---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CableTraySettings.FittingAnnotationSize
source: html/91efce56-69c4-4a6e-c136-4a2ad3167842.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySettings.FittingAnnotationSize Property

The value of fitting annotation size.

## Syntax (C#)
```csharp
public double FittingAnnotationSize { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for fittingAnnotationSize must be between 0 and 30000 feet.